OpenFOAM_Artery_Lab_ADT/sourses/exmpl1/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application icoFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 4.0;

deltaT 0.0005;

writeControl adjustableRunTime;

writeInterval 0.25;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
