OpenFOAM_Artery_Lab_ADT/sourses/exmpl1/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 8; // Количество процессоров

method          scotch; // Метод разбиения (simple, scotch, hierarchical)

simpleCoeffs
{
    n               (4 2 1); // Разбиение по осям x, y, z
    delta           0.001;   // Параметр для балансировки нагрузки
}

hierarchicalCoeffs
{
    n               (4 2 1); // Разбиение по осям x, y, z
    order           xyz;     // Порядок разбиения
}
